name: "deep-learning-analytics-Grammar-Correction-T5"
backend: "python"

max_batch_size: 8  # We allow batching, so Triton will prepend a batch dimension.

input [
  {
    name: "DUMMY_INPUT"
    data_type: TYPE_STRING
    # 2 dims here => final shape is (batch, -1, -1)
    dims: [ -1, -1 ]
  }
]

output [
  {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]