name: "whisper"
backend: "python"

input [
  {
    name: "AUDIO_INPUT"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

output [
  {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]